<template>
<div>
    <img src="/assets/img/a1.png" class="noselect header_img" draggable="false"/>

    <div style="font-size: 15px; text-align: justify;">
        <p>
            LoliLand.ru, в лице игрового проекта LoliLand (далее ПРОДАВЕЦ), публикует настоящий договор, являющийся публичным договором-офертой в адрес как физических, так и юридических лиц (далее ПОКУПАТЕЛЬ) о нижеследующем:
        </p>
        <p>
            Статья 1. Предмет договора-оферты.<br>
            1.1. ПРОДАВЕЦ обязуется передать в собственность ПОКУПАТЕЛЮ, а ПОКУПАТЕЛЬ обязуется оплатить и принять заказанные в игровом проекте LoliLand товары и услуги (далее ТОВАР).
        </p>
        <p>
            Статья 2. Момент заключения договора.<br>
            2.1. Текст данного Договора является публичной офертой (в соответствии со статьей 435 и частью 2 статьи 437 Гражданского кодекса РФ).<br>
            2.2. Факт оформления ЗАКАЗА ТОВАРА у ПРОДАВЦА как самостоятельно, так и через поддержку, является безоговорочным принятием данного Договора, и ПОКУПАТЕЛЬ рассматривается как лицо, вступившее с LoliLand.ru в договорные отношения.<br>
            2.3. Оформление ЗАКАЗА ТОВАРА и расчета осуществляется путем заказа ПОКУПАТЕЛЕМ в игровом проекте LoliLand.
        </p>
        <p>
            Статья 3. Цена ТОВАРА.<br>
            3.1. Цены в игровом проекте указаны в валюте страны покупателя за единицу ТОВАРА.<br>
            3.2. Общая сумма ЗАКАЗА, которая в некоторых случаях (по требованию систем оплаты) может включать комиссию в стоимость ТОВАРА, указывается в разделе платежной системы в строке «Сумма».
        </p>
        <p>
            Статья 4. Оплата ТОВАРА.<br>
            4.1. При безналичной форме оплаты обязанность ПОКУПАТЕЛЯ по уплате цены ТОВАРА считается исполненной с момента зачисления соответствующих денежных средств в размере 100% (ста процентов) предоплаты на расчетный счет ПРОДАВЦА.<br>
            4.2. ТОВАРЫ поставляются ПОКУПАТЕЛЮ по ценам, наименованию, в количестве, соответствующем счету, оплаченному ПОКУПАТЕЛЕМ.
        </p>
        <p>
            Статья 5. Доставка ТОВАРА.<br>
            5.1. Доставка ТОВАРА ПОКУПАТЕЛЮ осуществляется в автоматическом режиме, кроме товара который требует обработки модератором, о чем ПОКУПАТЕЛЮ будет сообщено в описание к товару.
        </p>
        <p>
            Статья 6. Права и обязанности сторон.<br>
            6.1. ПРОДАВЕЦ обязуется:<br>
            6.1.1. Не разглашать любую частную информацию ПОКУПАТЕЛЯ и не предоставлять доступ к этой информации третьим лицам, за исключением случаев, предусмотренных Российским законодательством.<br>
            6.1.2. Предоставить ПОКУПАТЕЛЮ возможность получения бесплатных консультаций по контактам, указанным на сайте игрового проекта (LoliLand.ru). Объем консультаций ограничивается конкретными вопросами, связанными с выполнениями ЗАКАЗА.<br>
            6.1.3. ПРОДАВЕЦ оставляет за собой право изменять настоящий ДОГОВОР в одностороннем порядке до момента его заключения.<br>
            6.1.4. ПРОДАВЕЦ может отказать в выдаче привилегии после ВАЙПА (Вайп - Очистка карт и данных игроков за определенный промежуток времени) серверов проекта, если она была куплена более чем за 15 дней до ВАЙПА.<br>
            6.1.5. ПРОДАВЕЦ может отказать в выдаче купленных внутриигровых предметов после ВАЙПА (Вайп - Очистка карт и данных игроков за определенный промежуток времени) серверов проекта, если они были куплены более чем за 10 дней до ВАЙПА.<br>
            6.2. ПОКУПАТЕЛЬ обязуется:<br>
            6.2.1. До момента заключения ДОГОВОРА ознакомиться с договором-офертой, правилами, пользовательским соглашением, условиями оплаты и доставки на сайте игрового проекта (LoliLand.ru).<br>
            6.2.2. Предоставлять достоверную информацию о себе (ФИО, контактные данные, адрес электронной почты и т.д.).<br>
            6.2.3. Принять и оплатить ТОВАР в указанные в настоящем ДОГОВОРЕ сроки.
        </p>
        <p>
            Статья 7. Ответственность сторон и разрешение споров.<br>
            7.1. Стороны несут ответственность за неисполнение или ненадлежащее исполнение настоящего ДОГОВОРА в порядке, предусмотренном настоящим ДОГОВОРОМ и действующим законодательством РФ.<br>
            7.2. ПРОДАВЕЦ не несет ответственности, если ожидания ПОКУПАТЕЛЯ о потребительских свойствах ТОВАРА оказались не оправданы.<br>
            7.3. ПРОДАВЕЦ не несет ответственности за частичное или полное неисполнение обязательств по доставке ТОВАРА, если они являются следствием форс-мажорных обстоятельств.<br>
            7.4. ПОКУПАТЕЛЬ, оформляя ЗАКАЗ, несет ответственность за достоверность предоставляемой информации о себе, а также подтверждает, что с условиями настоящего ДОГОВОРА ознакомлен и согласен.<br>
            7.5. Все споры и разногласия, возникающие при исполнении СТОРОНАМИ обязательств по настоящему Договору, решаются путем переговоров. В случае невозможности их устранения, СТОРОНЫ имеют право обратиться за судебной защитой своих интересов.
        </p>
        <p>
            Статья 8. Форс-мажорные обстоятельства.<br>
            8.1. Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по Договору на время действия непреодолимой силы. Под непреодолимой силой понимаются чрезвычайные и непреодолимые при данных условиях обстоятельства, препятствующие исполнению своих обязательств СТОРОНАМИ по настоящему Договору. К ним относятся стихийные явления (землетрясения, наводнения и т. п.), обстоятельства общественной жизни (военные действия, чрезвычайные положения, крупнейшие забастовки, эпидемии и т. п.), запретительные меры государственных органов (запрещение перевозок, валютные ограничения, международные санкции запрета на торговлю и т. п.). В течение этого времени СТОРОНЫ не имеют взаимных претензий, и каждая из СТОРОН принимает на себя свой риск последствия форс-мажорных обстоятельств.
        </p>
        <p>
            Статья 9. Срок действия договора.<br>
            9.1. Настоящий ДОГОВОР вступает в силу с момента обращения в LoliLand.ru и оформления ЗАКАЗА, и заканчивается при полном исполнении обязательств СТОРОНАМИ.
        </p>
    </div>
</div>
</template>

<script>
    import { EventBus, API } from '@/main.js';
    export default { 
        name: 'Rules',
        data () {
            return {
                rules: null,
            }
        },
        methods: {
            listener(packet, data) {
                if(packet === 'rules.load') {
                    if (data.type === 'rules') {
                        this.rules = data.rules;
                    } 
                }
            },
            getRule(rule) {
                if(!rule.endsWith('.')) {
                    rule = rule + '.';
                }
                rule = rule[0].toUpperCase() + rule.slice(1); 
                return rule;
            },
            getNote(note) {
                if(!note.endsWith('.')) {
                    note = note + '.';
                }
                note = note[0].toUpperCase() + note.slice(1); 
                return note.trim();
            },
            getPunishment(punishment) {
                var str = '';
                switch(punishment.type) {
                    case 'ban': 
                        str = str + 'Бан ';
                        if(punishment.time != null) {
                            str = str + 'на ' + punishment.time;
                        } else {
                            str = str + 'навсегда';
                        }
                        break;
                    case 'mute': 
                        str = str + 'Мут чата ';
                        if(punishment.time != null) {
                            str = str + 'на ' + punishment.time;
                        } else {
                            str = str + 'навсегда';
                        }
                        break;
                    case 'banhw': 
                        str = str + 'Бан по железу игрока';
                        break;
                    case 'warn': 
                        str = str + 'Предупреждение';
                        break;
                }
                if(punishment.note) {
                    str = str + ' и ' + punishment.note.toLowerCase();
                }
                if(!str.endsWith('.')) {
                    str = str + '.';
                }
                return str.trim();
            }
        },
        mounted() {
            this.$root.$emit('send_websocket', `{"packet":"rules.load","data":{}}`);
        },
        created() {
            EventBus.$on('onProcessPacket', this.listener);
        },
        beforeDestroy() {
            EventBus.$off('onProcessPacket', this.listener);
        },
        computed: {
            isAuthenticated () {
        	    return this.$store.getters.authenticated
            },
            isPendingLogin2FA () {
        	    return this.$store.state.auth.pendingLogin2FA
            },
            API() {
                return API;
            }
        }
    }
</script>

<style scoped>
    .component-fade-enter-active, .component-fade-leave-active {
        transition: opacity .3s ease;
    }
    .component-fade-enter, .component-fade-leave-to {
        opacity: 0;
        position: absolute;
        width: 670px;
        height: 100%;
    }

    .rules {
        color: #fd2f52;
        /*background: linear-gradient(45deg, #810101, #e00);
        background-clip: text;
        -webkit-text-fill-color: transparent;*/
        font-size: 25px;
        font-weight: bolder;
        font-family: 'Ubuntu';
        text-transform: uppercase;
    }

    .ui-box.green {
        color: #659F13;
        background-color: rgba(242, 250, 227, 0.6);
        border-color: #C8DFA5;
    }

    .ui-box.red {
        color: #D85030;
        background-color: rgba(255, 241, 240, 0.6);
        border-color: #F4C1B6;
    }

    .ui-box {
        margin: 4px 0;
        background: rgba(235, 247, 253, 0.6);
        padding: 8px 10px;
        color: #2D7091;
        font-size: 14px;
        border-left: 4px solid #B2CFDD;
        text-align: left;
    }

    table.modern {
        width: 100%;
        margin-bottom: 15px;
        border-spacing: 0px 1px;
        font-family: 'Ubuntu'
    }

    table.modern td,
    table.modern th {
        padding: 8px 10px;
        vertical-align: top
    }

    table.modern th {
        padding-top: 4px;
        padding-bottom: 4px;
        font-size: 14px;
        text-align: center;
        border-bottom: 3px solid #fd6982;
        font-weight: 400;
        text-align: left;
        text-transform: uppercase
    }

    table.modern td {
        border-bottom: 0px solid #F0F0F0
    }

    table.modern td {
        background-color: #f9f9f973;
        border-color: #EAEAEA;
        text-align: justify;
    }
</style>

